In [59]:
import pandas as pd
import numpy as np

In [60]:
s = pd.Series([1, 3, 5, 3, 6, 8])
s

0    1
1    3
2    5
3    3
4    6
5    8
dtype: int64

In [61]:
s1 = pd.Series(np.random.randn(5), index=["a", "b", "c", "d", "e"])
s1

a   -0.120440
b   -0.332877
c   -1.056484
d    0.662049
e    0.853970
dtype: float64

In [115]:
s1['a']

-0.12043987192190737

In [62]:
d = {"b": 1, "a": 0, "c": 2}
pd.Series(d)

b    1
a    0
c    2
dtype: int64

In [63]:
data = pd.Series(range(100,1000,100))
data

0    100
1    200
2    300
3    400
4    500
5    600
6    700
7    800
8    900
dtype: int64

In [64]:
slice1 = data[2:7]
slice1

2    300
3    400
4    500
5    600
6    700
dtype: int64

In [65]:
slice1[3:5]

5    600
6    700
dtype: int64

In [124]:
slice1

2    300
3    400
4    500
5    600
6    700
dtype: int64

In [128]:
slice1.iloc[3:5] # берется как в срезах от 3 по 4 (от 0 до числа не включит)

5    600
6    700
dtype: int64

In [129]:
slice1.loc[3:5] # берется по индексу 3,4,5

3    400
4    500
5    600
dtype: int64

Add Data to Series

In [150]:
s = pd.Series(data = [0, 10, 30, 20], index = [1,2,3,4])

In [151]:
s

1     0
2    10
3    30
4    20
dtype: int64

In [152]:
s.pop(1)  # удаляется по индексу вся строка

0

In [153]:
s

2    10
3    30
4    20
dtype: int64

In [154]:
s.loc[5] = 40  # 
s

2    10
3    30
4    20
5    40
dtype: int64

In [155]:
s.loc[1] = 100

In [156]:
s

2     10
3     30
4     20
5     40
1    100
dtype: int64

In [158]:
s.sort_index() # inplace = True сохраняет отсортированную индексацию
s

1    100
2     10
3     30
4     20
5     40
dtype: int64

Concat

In [183]:
a = pd.Series(data = [10,20,30], index = [1,2,3])
b = pd.Series(data = [100,200,300], index = [1,2,3])

In [184]:
a[2]

20

In [185]:
c = pd.concat([a,b]) # loc iloc
c

1     10
2     20
3     30
1    100
2    200
3    300
dtype: int64

In [186]:
c[1] = 1000# заменится 1 индекс на 1000 во всех местах
c

1    1000
2      20
3      30
1    1000
2     200
3     300
dtype: int64

In [187]:
c.index.is_unique

False

In [188]:
c.loc[1]

1    1000
1    1000
dtype: int64

In [189]:
c[1]=11
c

1     11
2     20
3     30
1     11
2    200
3    300
dtype: int64

In [190]:
c

1     11
2     20
3     30
1     11
2    200
3    300
dtype: int64

In [191]:
c.reset_index()[0]

0     11
1     20
2     30
3     11
4    200
5    300
Name: 0, dtype: int64

In [193]:
c.reset_index() # появляется столбец сквозных индексов с 0

   index    0
0      1   11
1      2   20
2      3   30
3      1   11
4      2  200
5      3  300

Agregation

In [220]:
values = [1,4,6,7, np.nan, 7,1, np.nan,4]
a = np.array(values)
b = pd.Series(values)

In [221]:
a

array([ 1.,  4.,  6.,  7., nan,  7.,  1., nan,  4.])

In [222]:
b

0    1.0
1    4.0
2    6.0
3    7.0
4    NaN
5    7.0
6    1.0
7    NaN
8    4.0
dtype: float64

In [223]:
for c in a, b:
    print (type(c))
    print (c.mean(), c.max(), c.std())

<class 'numpy.ndarray'>
nan nan nan
<class 'pandas.core.series.Series'>
4.285714285714286 7.0 2.563479777846623

In [224]:
c # равная b

0    1.0
1    4.0
2    6.0
3    7.0
4    NaN
5    7.0
6    1.0
7    NaN
8    4.0
dtype: float64

In [225]:
c.unique()

array([ 1.,  4.,  6.,  7., nan])

Частотный анализ

In [226]:
c.value_counts() #dropna = False без NaN

1.0    2
4.0    2
7.0    2
6.0    1
dtype: int64

In [227]:
c.value_counts(dropna = False) #dropna = False появился NaN

1.0    2
4.0    2
7.0    2
NaN    2
6.0    1
dtype: int64

In [228]:
c.quantile(3/4)#числа до 6,5 составляют 75% всех значений

6.5

In [229]:
c.min(), c.max(), c.mean(), c.median(), c.count(), c.std()

(1.0, 7.0, 4.285714285714286, 4.0, 7, 2.563479777846623)

In [230]:
c.describe()

count    7.000000
mean     4.285714
std      2.563480
min      1.000000
25%      2.500000
50%      4.000000
75%      6.500000
max      7.000000
dtype: float64

In [231]:
c.describe()['count'] # обращение к самой функции count

7.0

Skipped values

In [232]:
c.isna() # any # sum

0    False
1    False
2    False
3    False
4     True
5    False
6    False
7     True
8    False
dtype: bool

In [233]:
c.isna().any()# выдаст True если есть хоть одно значение Na, или False если нет Na

True

In [237]:
c.dropna() # inplace #удаляет пустые значения, при этом серия не меняется

0    1.0
1    4.0
2    6.0
3    7.0
5    7.0
6    1.0
8    4.0
dtype: float64

In [238]:
c

0    1.0
1    4.0
2    6.0
3    7.0
4    NaN
5    7.0
6    1.0
7    NaN
8    4.0
dtype: float64

In [239]:
c.dropna(inplace = True) # inplace меняет серию, теперь с(без Na)

In [240]:
c

0    1.0
1    4.0
2    6.0
3    7.0
5    7.0
6    1.0
8    4.0
dtype: float64

In [96]:
c.fillna() # inplace

ValueError: Must specify a fill 'value' or 'method'.

Operations

In [54]:
A = pd.Series(data = [10,20,30,40], index = ['a', 'b', 'c', 'd'])
B = pd.Series(data = [1,2,3,4], index = ['a', 'b', 'c', 'd'])

In [ ]:
A+B # > access mask

In [60]:
import math

In [64]:
B.apply()

Update

In [65]:
a = pd.Series(data = [300,350,400,800,690], index = ['Bob','Bruce','Jim','Ian','Rob'])
b = pd.Series(data = [10000,0], index = ['Jim','Bob'])

In [66]:
a.update(b)

### DATAFRAME

In [69]:
d = {"one": [1.0, 2.0, 3.0], "two": [4.0, 3.0, 2.0]}
df = pd.DataFrame(d, index = ['First','Second','Third'])

In [ ]:
df.index

In [ ]:
df.columns

In [71]:
#df['one'] # доступ к серии

новый столбик

In [73]:
df.three = df.one*20 + df.two**2

In [75]:
df.three

First     36.0
Second    49.0
Third     64.0
dtype: float64

In [76]:
df[1:3]

        one  two  three
Second  2.0  3.0   49.0
Third   3.0  2.0   64.0

In [78]:
df['First':'Second']

        one  two  three
First   1.0  4.0   36.0
Second  2.0  3.0   49.0

In [79]:
df.iloc[1:3]

        one  two  three
Second  2.0  3.0   49.0
Third   3.0  2.0   64.0

In [80]:
df.loc['First':'Second']

        one  two  three
First   1.0  4.0   36.0
Second  2.0  3.0   49.0

In [81]:
df.loc['Second'] # серия значений одной строки

one       2.0
two       3.0
three    49.0
Name: Second, dtype: float64

In [83]:
df.loc['Second', 'two']

3.0

In [82]:
df.loc['First':'Second', 'one': 'two']

        one  two
First   1.0  4.0
Second  2.0  3.0

In [85]:
df.loc['First':'Second', ['three', 'one']]

        three  one
First    36.0  1.0
Second   49.0  2.0

Frame agregation

In [86]:
df.sum() # по умолчанию посчитает сумму по столбцам (то есть сложит значения в строках)

one        6.0
two        9.0
three    149.0
dtype: float64

In [87]:
df.sum(axis=1)

First     41.0
Second    54.0
Third     69.0
dtype: float64

In [88]:
df.max()

one       3.0
two       4.0
three    64.0
dtype: float64

In [90]:
df.idxmax()

one      Third
two      First
three    Third
dtype: object

In [91]:
df.agg(['min','idxmin', 'max', 'idxmax', 'sum', 'mean'])

          one    two      three
min       1.0    2.0       36.0
idxmin  First  Third      First
max       3.0    4.0       64.0
idxmax  Third  First      Third
sum       6.0    9.0      149.0
mean      2.0    3.0  49.666667

In [ ]:
# drop

In [93]:
#df.drop(columns = ['one', 'three'])

In [96]:
#df.drop(index = ['Second', 'Third'])

In [98]:
df.loc['Second','two'] = np.nan

In [99]:
df

        one  two  three
First   1.0  4.0   36.0
Second  2.0  NaN   49.0
Third   3.0  2.0   64.0

In [100]:
df.dropna()

       one  two  three
First  1.0  4.0   36.0
Third  3.0  2.0   64.0

In [101]:
df.dropna(axis = 1) # 'columns'

        one  three
First   1.0   36.0
Second  2.0   49.0
Third   3.0   64.0

In [103]:
df.interpolate()

        one  two  three
First   1.0  4.0   36.0
Second  2.0  3.0   49.0
Third   3.0  2.0   64.0

In [106]:
df = pd.DataFrame({'name':['Петя','Маша','Марина','Петя','Маша','Марина','Марина','Маша','Марина','Тузик'],
                  'val1':[1,2,3,4,5,0,5,4,3,2],
                  'val2':[10,20,30,40,50,1,.5,.4,.3,.2]})

In [108]:
#df.sum()

In [110]:
#df.agg(['min','max'])

GroupBy

In [111]:
df.groupby(['name'])

In [115]:
#df.groupby(['name']).sum()

In [116]:
#df.groupby(['name']).val1.agg(['min','max'])